syms x
% Исходная функция
f = x^3 - 10/(2-x)^2 + 25;
% Приводим к общему знаменателю
ff = factor(f)
% Извлекаем числитель
[f_nm,~] = numden(ff)
% Собираем коэффициенты в порядке убывания
[my_coeffs,~] = coeffs(f_nm,x)
% Найдем корни полинома
r = roots(my_coeffs)
% r =
%  
%                                       -2.9077407016914873169506191942647
%                                        1.3996100646468305812335683631853
%                                        2.4965355242358652368432085736757
%  1.5057975564043957494369211287019 - 2.5672365012647893529547353691146*i
%  1.5057975564043957494369211287019 + 2.5672365012647893529547353691146*i
%
plot(real(r),imag(r),'ro'), grid on
xlabel('Re(z)'),ylabel('Im(z)')