clear; clc
% Вершины квадрата и его цвет
x = [-1,-1,1,1];
y = [-1,1,1,-1];
C = [1;1;0;0];
% Рисование квадрата
fill(x,y,C)
title('Исходный квадрат')
axis ([-10 10 -10 10])
axis square
grid on

pause(2)

% УсловиЯ преобразований координат:
a = 20*pi/180; % угол поворота
s = 3; % коэффициент масштабированиЯ
m = 1; % коэффициент зеркального отображениЯ
b = 30*pi/180; % угол сдвига

hold on
% Закрепили и поехали преобразовывать

R = [ cos(a), sin(a); ...
     -sin(a), cos(a)];
xn = R*[x;y];
fill(xn(1,:),xn(2,:),C)
title(['Поворот на угол a = ', num2str(a), ' рад.'])
pause(2)

S = [s, 0; ...
     0, s];
xn = S*R*[x;y];
fill(xn(1,:),xn(2,:),C)
title(['Масштабирование в s = ', num2str(s), ' раза'])
pause(2)

M = [-m, 0; ...
     0, -m];
xn = M*S*R*[x;y];
fill(xn(1,:),xn(2,:),C)
title(['Зеркальное отображение с m = ', num2str(m)'])
pause(2)

Sh = [cos(b), sin(b); ...
      sin(b), cos(b)];
xn = Sh*M*S*R*[x;y];
fill(xn(1,:),xn(2,:),C)
title(['Сдвиг на угол b = ', num2str(b), ' рад.'])